grevaillot/svd_tools/headers/ATSAM4S2B/pioa.h
/** PIOA_PDR_P31 PIO Disable **/
#define PIOA_PDR_P31		(1 << 31)
/** PIOA_PDR_P30 PIO Disable **/
#define PIOA_PDR_P30		(1 << 30)
/** PIOA_PDR_P29 PIO Disable **/
#define PIOA_PDR_P29		(1 << 29)
/** PIOA_PDR_P28 PIO Disable **/
#define PIOA_PDR_P28		(1 << 28)
/** PIOA_PDR_P27 PIO Disable **/
#define PIOA_PDR_P27		(1 << 27)
/** PIOA_PDR_P26 PIO Disable **/
#define PIOA_PDR_P26		(1 << 26)
/** PIOA_PDR_P25 PIO Disable **/
#define PIOA_PDR_P25		(1 << 25)
/** PIOA_PDR_P24 PIO Disable **/
#define PIOA_PDR_P24		(1 << 24)
/** PIOA_PDR_P23 PIO Disable **/
#define PIOA_PDR_P23		(1 << 23)
/** PIOA_PDR_P22 PIO Disable **/
#define PIOA_PDR_P22		(1 << 22)
/** PIOA_PDR_P21 PIO Disable **/
#define PIOA_PDR_P21		(1 << 21)
/** PIOA_PDR_P20 PIO Disable **/
#define PIOA_PDR_P20		(1 << 20)
/** PIOA_PDR_P19 PIO Disable **/
#define PIOA_PDR_P19		(1 << 19)
/** PIOA_PDR_P18 PIO Disable **/
#define PIOA_PDR_P18		(1 << 18)
/** PIOA_PDR_P17 PIO Disable **/
#define PIOA_PDR_P17		(1 << 17)
/** PIOA_PDR_P16 PIO Disable **/
#define PIOA_PDR_P16		(1 << 16)
/** PIOA_PDR_P15 PIO Disable **/
#define PIOA_PDR_P15		(1 << 15)
/** PIOA_PDR_P14 PIO Disable **/
#define PIOA_PDR_P14		(1 << 14)
/** PIOA_PDR_P13 PIO Disable **/
#define PIOA_PDR_P13		(1 << 13)
/** PIOA_PDR_P12 PIO Disable **/
#define PIOA_PDR_P12		(1 << 12)
/** PIOA_PDR_P11 PIO Disable **/
#define PIOA_PDR_P11		(1 << 11)
/** PIOA_PDR_P10 PIO Disable **/
#define PIOA_PDR_P10		(1 << 10)
/** PIOA_PDR_P9 PIO Disable **/
#define PIOA_PDR_P9		(1 << 9)
/** PIOA_PDR_P8 PIO Disable **/
#define PIOA_PDR_P8		(1 << 8)
/** PIOA_PDR_P7 PIO Disable **/
#define PIOA_PDR_P7		(1 << 7)
/** PIOA_PDR_P6 PIO Disable **/
#define PIOA_PDR_P6		(1 << 6)
/** PIOA_PDR_P5 PIO Disable **/
#define PIOA_PDR_P5		(1 << 5)
/** PIOA_PDR_P4 PIO Disable **/
#define PIOA_PDR_P4		(1 << 4)
/** PIOA_PDR_P3 PIO Disable **/
#define PIOA_PDR_P3		(1 << 3)
/** PIOA_PDR_P2 PIO Disable **/
#define PIOA_PDR_P2		(1 << 2)
/** PIOA_PDR_P1 PIO Disable **/
#define PIOA_PDR_P1		(1 << 1)
/** PIOA_PDR_P0 PIO Disable **/
#define PIOA_PDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_psr PSR PIO Status Register
@{*/

/** PIOA_PSR_P31 PIO Status **/
#define PIOA_PSR_P31		(1 << 31)
/** PIOA_PSR_P30 PIO Status **/
#define PIOA_PSR_P30		(1 << 30)
/** PIOA_PSR_P29 PIO Status **/
#define PIOA_PSR_P29		(1 << 29)
/** PIOA_PSR_P28 PIO Status **/
#define PIOA_PSR_P28		(1 << 28)
/** PIOA_PSR_P27 PIO Status **/
#define PIOA_PSR_P27		(1 << 27)
/** PIOA_PSR_P26 PIO Status **/
#define PIOA_PSR_P26		(1 << 26)
/** PIOA_PSR_P25 PIO Status **/
#define PIOA_PSR_P25		(1 << 25)
/** PIOA_PSR_P24 PIO Status **/
#define PIOA_PSR_P24		(1 << 24)
/** PIOA_PSR_P23 PIO Status **/
#define PIOA_PSR_P23		(1 << 23)
/** PIOA_PSR_P22 PIO Status **/
#define PIOA_PSR_P22		(1 << 22)
/** PIOA_PSR_P21 PIO Status **/
#define PIOA_PSR_P21		(1 << 21)
/** PIOA_PSR_P20 PIO Status **/
#define PIOA_PSR_P20		(1 << 20)
/** PIOA_PSR_P19 PIO Status **/
#define PIOA_PSR_P19		(1 << 19)
/** PIOA_PSR_P18 PIO Status **/
#define PIOA_PSR_P18		(1 << 18)
/** PIOA_PSR_P17 PIO Status **/
#define PIOA_PSR_P17		(1 << 17)
/** PIOA_PSR_P16 PIO Status **/
#define PIOA_PSR_P16		(1 << 16)
/** PIOA_PSR_P15 PIO Status **/
#define PIOA_PSR_P15		(1 << 15)
/** PIOA_PSR_P14 PIO Status **/
#define PIOA_PSR_P14		(1 << 14)
/** PIOA_PSR_P13 PIO Status **/
#define PIOA_PSR_P13		(1 << 13)
/** PIOA_PSR_P12 PIO Status **/
#define PIOA_PSR_P12		(1 << 12)
/** PIOA_PSR_P11 PIO Status **/
#define PIOA_PSR_P11		(1 << 11)
/** PIOA_PSR_P10 PIO Status **/
#define PIOA_PSR_P10		(1 << 10)
/** PIOA_PSR_P9 PIO Status **/
#define PIOA_PSR_P9		(1 << 9)
/** PIOA_PSR_P8 PIO Status **/
#define PIOA_PSR_P8		(1 << 8)
/** PIOA_PSR_P7 PIO Status **/
#define PIOA_PSR_P7		(1 << 7)
/** PIOA_PSR_P6 PIO Status **/
#define PIOA_PSR_P6		(1 << 6)
/** PIOA_PSR_P5 PIO Status **/
#define PIOA_PSR_P5		(1 << 5)
/** PIOA_PSR_P4 PIO Status **/
#define PIOA_PSR_P4		(1 << 4)
/** PIOA_PSR_P3 PIO Status **/
#define PIOA_PSR_P3		(1 << 3)
/** PIOA_PSR_P2 PIO Status **/
#define PIOA_PSR_P2		(1 << 2)
/** PIOA_PSR_P1 PIO Status **/
#define PIOA_PSR_P1		(1 << 1)
/** PIOA_PSR_P0 PIO Status **/
#define PIOA_PSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_oer OER Output Enable Register
@{*/

/** PIOA_OER_P31 Output Enable **/
#define PIOA_OER_P31		(1 << 31)
/** PIOA_OER_P30 Output Enable **/
#define PIOA_OER_P30		(1 << 30)
/** PIOA_OER_P29 Output Enable **/
#define PIOA_OER_P29		(1 << 29)
/** PIOA_OER_P28 Output Enable **/
#define PIOA_OER_P28		(1 << 28)
/** PIOA_OER_P27 Output Enable **/
#define PIOA_OER_P27		(1 << 27)
/** PIOA_OER_P26 Output Enable **/
#define PIOA_OER_P26		(1 << 26)
/** PIOA_OER_P25 Output Enable **/
#define PIOA_OER_P25		(1 << 25)
/** PIOA_OER_P24 Output Enable **/
#define PIOA_OER_P24		(1 << 24)
/** PIOA_OER_P23 Output Enable **/
#define PIOA_OER_P23		(1 << 23)
/** PIOA_OER_P22 Output Enable **/
#define PIOA_OER_P22		(1 << 22)
/** PIOA_OER_P21 Output Enable **/
#define PIOA_OER_P21		(1 << 21)
/** PIOA_OER_P20 Output Enable **/
#define PIOA_OER_P20		(1 << 20)
/** PIOA_OER_P19 Output Enable **/
#define PIOA_OER_P19		(1 << 19)
/** PIOA_OER_P18 Output Enable **/
#define PIOA_OER_P18		(1 << 18)
/** PIOA_OER_P17 Output Enable **/
#define PIOA_OER_P17		(1 << 17)
/** PIOA_OER_P16 Output Enable **/
#define PIOA_OER_P16		(1 << 16)
/** PIOA_OER_P15 Output Enable **/
#define PIOA_OER_P15		(1 << 15)
/** PIOA_OER_P14 Output Enable **/
#define PIOA_OER_P14		(1 << 14)
/** PIOA_OER_P13 Output Enable **/
#define PIOA_OER_P13		(1 << 13)
/** PIOA_OER_P12 Output Enable **/
#define PIOA_OER_P12		(1 << 12)
/** PIOA_OER_P11 Output Enable **/
#define PIOA_OER_P11		(1 << 11)
/** PIOA_OER_P10 Output Enable **/
#define PIOA_OER_P10		(1 << 10)
/** PIOA_OER_P9 Output Enable **/
#define PIOA_OER_P9		(1 << 9)
/** PIOA_OER_P8 Output Enable **/
#define PIOA_OER_P8		(1 << 8)
/** PIOA_OER_P7 Output Enable **/
#define PIOA_OER_P7		(1 << 7)
/** PIOA_OER_P6 Output Enable **/
#define PIOA_OER_P6		(1 << 6)
/** PIOA_OER_P5 Output Enable **/
#define PIOA_OER_P5		(1 << 5)
/** PIOA_OER_P4 Output Enable **/
#define PIOA_OER_P4		(1 << 4)
/** PIOA_OER_P3 Output Enable **/
#define PIOA_OER_P3		(1 << 3)
/** PIOA_OER_P2 Output Enable **/
#define PIOA_OER_P2		(1 << 2)
/** PIOA_OER_P1 Output Enable **/
#define PIOA_OER_P1		(1 << 1)
/** PIOA_OER_P0 Output Enable **/
#define PIOA_OER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_odr ODR Output Disable Register
@{*/

/** PIOA_ODR_P31 Output Disable **/
#define PIOA_ODR_P31		(1 << 31)
/** PIOA_ODR_P30 Output Disable **/
#define PIOA_ODR_P30		(1 << 30)
/** PIOA_ODR_P29 Output Disable **/
#define PIOA_ODR_P29		(1 << 29)
/** PIOA_ODR_P28 Output Disable **/
#define PIOA_ODR_P28		(1 << 28)
/** PIOA_ODR_P27 Output Disable **/
#define PIOA_ODR_P27		(1 << 27)
/** PIOA_ODR_P26 Output Disable **/
#define PIOA_ODR_P26		(1 << 26)
/** PIOA_ODR_P25 Output Disable **/
#define PIOA_ODR_P25		(1 << 25)
/** PIOA_ODR_P24 Output Disable **/
#define PIOA_ODR_P24		(1 << 24)
/** PIOA_ODR_P23 Output Disable **/
#define PIOA_ODR_P23		(1 << 23)
/** PIOA_ODR_P22 Output Disable **/
#define PIOA_ODR_P22		(1 << 22)
/** PIOA_ODR_P21 Output Disable **/
#define PIOA_ODR_P21		(1 << 21)
/** PIOA_ODR_P20 Output Disable **/
#define PIOA_ODR_P20		(1 << 20)
/** PIOA_ODR_P19 Output Disable **/
#define PIOA_ODR_P19		(1 << 19)
/** PIOA_ODR_P18 Output Disable **/
#define PIOA_ODR_P18		(1 << 18)
/** PIOA_ODR_P17 Output Disable **/
#define PIOA_ODR_P17		(1 << 17)
/** PIOA_ODR_P16 Output Disable **/
#define PIOA_ODR_P16		(1 << 16)
/** PIOA_ODR_P15 Output Disable **/
#define PIOA_ODR_P15		(1 << 15)
/** PIOA_ODR_P14 Output Disable **/
#define PIOA_ODR_P14		(1 << 14)
/** PIOA_ODR_P13 Output Disable **/
#define PIOA_ODR_P13		(1 << 13)
/** PIOA_ODR_P12 Output Disable **/
#define PIOA_ODR_P12		(1 << 12)
/** PIOA_ODR_P11 Output Disable **/
#define PIOA_ODR_P11		(1 << 11)
/** PIOA_ODR_P10 Output Disable **/
#define PIOA_ODR_P10		(1 << 10)
/** PIOA_ODR_P9 Output Disable **/
#define PIOA_ODR_P9		(1 << 9)
/** PIOA_ODR_P8 Output Disable **/
#define PIOA_ODR_P8		(1 << 8)
/** PIOA_ODR_P7 Output Disable **/
#define PIOA_ODR_P7		(1 << 7)
/** PIOA_ODR_P6 Output Disable **/
#define PIOA_ODR_P6		(1 << 6)
/** PIOA_ODR_P5 Output Disable **/
#define PIOA_ODR_P5		(1 << 5)
/** PIOA_ODR_P4 Output Disable **/
#define PIOA_ODR_P4		(1 << 4)
/** PIOA_ODR_P3 Output Disable **/
#define PIOA_ODR_P3		(1 << 3)
/** PIOA_ODR_P2 Output Disable **/
#define PIOA_ODR_P2		(1 << 2)
/** PIOA_ODR_P1 Output Disable **/
#define PIOA_ODR_P1		(1 << 1)
/** PIOA_ODR_P0 Output Disable **/
#define PIOA_ODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_osr OSR Output Status Register
@{*/

/** PIOA_OSR_P31 Output Status **/
#define PIOA_OSR_P31		(1 << 31)
/** PIOA_OSR_P30 Output Status **/
#define PIOA_OSR_P30		(1 << 30)
/** PIOA_OSR_P29 Output Status **/
#define PIOA_OSR_P29		(1 << 29)
/** PIOA_OSR_P28 Output Status **/
#define PIOA_OSR_P28		(1 << 28)
/** PIOA_OSR_P27 Output Status **/
#define PIOA_OSR_P27		(1 << 27)
/** PIOA_OSR_P26 Output Status **/
#define PIOA_OSR_P26		(1 << 26)
/** PIOA_OSR_P25 Output Status **/
#define PIOA_OSR_P25		(1 << 25)
/** PIOA_OSR_P24 Output Status **/
#define PIOA_OSR_P24		(1 << 24)
/** PIOA_OSR_P23 Output Status **/
#define PIOA_OSR_P23		(1 << 23)
/** PIOA_OSR_P22 Output Status **/
#define PIOA_OSR_P22		(1 << 22)
/** PIOA_OSR_P21 Output Status **/
#define PIOA_OSR_P21		(1 << 21)
/** PIOA_OSR_P20 Output Status **/
#define PIOA_OSR_P20		(1 << 20)
/** PIOA_OSR_P19 Output Status **/
#define PIOA_OSR_P19		(1 << 19)
/** PIOA_OSR_P18 Output Status **/
#define PIOA_OSR_P18		(1 << 18)
/** PIOA_OSR_P17 Output Status **/
#define PIOA_OSR_P17		(1 << 17)
/** PIOA_OSR_P16 Output Status **/
#define PIOA_OSR_P16		(1 << 16)
/** PIOA_OSR_P15 Output Status **/
#define PIOA_OSR_P15		(1 << 15)
/** PIOA_OSR_P14 Output Status **/
#define PIOA_OSR_P14		(1 << 14)
/** PIOA_OSR_P13 Output Status **/
#define PIOA_OSR_P13		(1 << 13)
/** PIOA_OSR_P12 Output Status **/
#define PIOA_OSR_P12		(1 << 12)
/** PIOA_OSR_P11 Output Status **/
#define PIOA_OSR_P11		(1 << 11)
/** PIOA_OSR_P10 Output Status **/
#define PIOA_OSR_P10		(1 << 10)
/** PIOA_OSR_P9 Output Status **/
#define PIOA_OSR_P9		(1 << 9)
/** PIOA_OSR_P8 Output Status **/
#define PIOA_OSR_P8		(1 << 8)
/** PIOA_OSR_P7 Output Status **/
#define PIOA_OSR_P7		(1 << 7)
/** PIOA_OSR_P6 Output Status **/
#define PIOA_OSR_P6		(1 << 6)
/** PIOA_OSR_P5 Output Status **/
#define PIOA_OSR_P5		(1 << 5)
/** PIOA_OSR_P4 Output Status **/
#define PIOA_OSR_P4		(1 << 4)
/** PIOA_OSR_P3 Output Status **/
#define PIOA_OSR_P3		(1 << 3)
/** PIOA_OSR_P2 Output Status **/
#define PIOA_OSR_P2		(1 << 2)
/** PIOA_OSR_P1 Output Status **/
#define PIOA_OSR_P1		(1 << 1)
/** PIOA_OSR_P0 Output Status **/
#define PIOA_OSR_P0		(1 << 0)

/**@}*/

