grevaillot/svd_tools/headers/ATSAM4S2B/pioa.h
/** @defgroup pioa_abcdsr[1] ABCDSR[1] Peripheral Select Register
@{*/

/** PIOA_ABCDSR[1]_P31 Peripheral Select **/
#define PIOA_ABCDSR[1]_P31		(1 << 31)
/** PIOA_ABCDSR[1]_P30 Peripheral Select **/
#define PIOA_ABCDSR[1]_P30		(1 << 30)
/** PIOA_ABCDSR[1]_P29 Peripheral Select **/
#define PIOA_ABCDSR[1]_P29		(1 << 29)
/** PIOA_ABCDSR[1]_P28 Peripheral Select **/
#define PIOA_ABCDSR[1]_P28		(1 << 28)
/** PIOA_ABCDSR[1]_P27 Peripheral Select **/
#define PIOA_ABCDSR[1]_P27		(1 << 27)
/** PIOA_ABCDSR[1]_P26 Peripheral Select **/
#define PIOA_ABCDSR[1]_P26		(1 << 26)
/** PIOA_ABCDSR[1]_P25 Peripheral Select **/
#define PIOA_ABCDSR[1]_P25		(1 << 25)
/** PIOA_ABCDSR[1]_P24 Peripheral Select **/
#define PIOA_ABCDSR[1]_P24		(1 << 24)
/** PIOA_ABCDSR[1]_P23 Peripheral Select **/
#define PIOA_ABCDSR[1]_P23		(1 << 23)
/** PIOA_ABCDSR[1]_P22 Peripheral Select **/
#define PIOA_ABCDSR[1]_P22		(1 << 22)
/** PIOA_ABCDSR[1]_P21 Peripheral Select **/
#define PIOA_ABCDSR[1]_P21		(1 << 21)
/** PIOA_ABCDSR[1]_P20 Peripheral Select **/
#define PIOA_ABCDSR[1]_P20		(1 << 20)
/** PIOA_ABCDSR[1]_P19 Peripheral Select **/
#define PIOA_ABCDSR[1]_P19		(1 << 19)
/** PIOA_ABCDSR[1]_P18 Peripheral Select **/
#define PIOA_ABCDSR[1]_P18		(1 << 18)
/** PIOA_ABCDSR[1]_P17 Peripheral Select **/
#define PIOA_ABCDSR[1]_P17		(1 << 17)
/** PIOA_ABCDSR[1]_P16 Peripheral Select **/
#define PIOA_ABCDSR[1]_P16		(1 << 16)
/** PIOA_ABCDSR[1]_P15 Peripheral Select **/
#define PIOA_ABCDSR[1]_P15		(1 << 15)
/** PIOA_ABCDSR[1]_P14 Peripheral Select **/
#define PIOA_ABCDSR[1]_P14		(1 << 14)
/** PIOA_ABCDSR[1]_P13 Peripheral Select **/
#define PIOA_ABCDSR[1]_P13		(1 << 13)
/** PIOA_ABCDSR[1]_P12 Peripheral Select **/
#define PIOA_ABCDSR[1]_P12		(1 << 12)
/** PIOA_ABCDSR[1]_P11 Peripheral Select **/
#define PIOA_ABCDSR[1]_P11		(1 << 11)
/** PIOA_ABCDSR[1]_P10 Peripheral Select **/
#define PIOA_ABCDSR[1]_P10		(1 << 10)
/** PIOA_ABCDSR[1]_P9 Peripheral Select **/
#define PIOA_ABCDSR[1]_P9		(1 << 9)
/** PIOA_ABCDSR[1]_P8 Peripheral Select **/
#define PIOA_ABCDSR[1]_P8		(1 << 8)
/** PIOA_ABCDSR[1]_P7 Peripheral Select **/
#define PIOA_ABCDSR[1]_P7		(1 << 7)
/** PIOA_ABCDSR[1]_P6 Peripheral Select **/
#define PIOA_ABCDSR[1]_P6		(1 << 6)
/** PIOA_ABCDSR[1]_P5 Peripheral Select **/
#define PIOA_ABCDSR[1]_P5		(1 << 5)
/** PIOA_ABCDSR[1]_P4 Peripheral Select **/
#define PIOA_ABCDSR[1]_P4		(1 << 4)
/** PIOA_ABCDSR[1]_P3 Peripheral Select **/
#define PIOA_ABCDSR[1]_P3		(1 << 3)
/** PIOA_ABCDSR[1]_P2 Peripheral Select **/
#define PIOA_ABCDSR[1]_P2		(1 << 2)
/** PIOA_ABCDSR[1]_P1 Peripheral Select **/
#define PIOA_ABCDSR[1]_P1		(1 << 1)
/** PIOA_ABCDSR[1]_P0 Peripheral Select **/
#define PIOA_ABCDSR[1]_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_ifscdr IFSCDR Input Filter Slow Clock Disable Register
@{*/

/** PIOA_IFSCDR_P31 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P31		(1 << 31)
/** PIOA_IFSCDR_P30 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P30		(1 << 30)
/** PIOA_IFSCDR_P29 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P29		(1 << 29)
/** PIOA_IFSCDR_P28 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P28		(1 << 28)
/** PIOA_IFSCDR_P27 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P27		(1 << 27)
/** PIOA_IFSCDR_P26 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P26		(1 << 26)
/** PIOA_IFSCDR_P25 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P25		(1 << 25)
/** PIOA_IFSCDR_P24 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P24		(1 << 24)
/** PIOA_IFSCDR_P23 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P23		(1 << 23)
/** PIOA_IFSCDR_P22 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P22		(1 << 22)
/** PIOA_IFSCDR_P21 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P21		(1 << 21)
/** PIOA_IFSCDR_P20 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P20		(1 << 20)
/** PIOA_IFSCDR_P19 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P19		(1 << 19)
/** PIOA_IFSCDR_P18 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P18		(1 << 18)
/** PIOA_IFSCDR_P17 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P17		(1 << 17)
/** PIOA_IFSCDR_P16 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P16		(1 << 16)
/** PIOA_IFSCDR_P15 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P15		(1 << 15)
/** PIOA_IFSCDR_P14 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P14		(1 << 14)
/** PIOA_IFSCDR_P13 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P13		(1 << 13)
/** PIOA_IFSCDR_P12 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P12		(1 << 12)
/** PIOA_IFSCDR_P11 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P11		(1 << 11)
/** PIOA_IFSCDR_P10 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P10		(1 << 10)
/** PIOA_IFSCDR_P9 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P9		(1 << 9)
/** PIOA_IFSCDR_P8 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P8		(1 << 8)
/** PIOA_IFSCDR_P7 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P7		(1 << 7)
/** PIOA_IFSCDR_P6 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P6		(1 << 6)
/** PIOA_IFSCDR_P5 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P5		(1 << 5)
/** PIOA_IFSCDR_P4 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P4		(1 << 4)
/** PIOA_IFSCDR_P3 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P3		(1 << 3)
/** PIOA_IFSCDR_P2 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P2		(1 << 2)
/** PIOA_IFSCDR_P1 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P1		(1 << 1)
/** PIOA_IFSCDR_P0 Peripheral Clock Glitch Filtering Select **/
#define PIOA_IFSCDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_ifscer IFSCER Input Filter Slow Clock Enable Register
@{*/

/** PIOA_IFSCER_P31 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P31		(1 << 31)
/** PIOA_IFSCER_P30 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P30		(1 << 30)
/** PIOA_IFSCER_P29 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P29		(1 << 29)
/** PIOA_IFSCER_P28 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P28		(1 << 28)
/** PIOA_IFSCER_P27 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P27		(1 << 27)
/** PIOA_IFSCER_P26 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P26		(1 << 26)
/** PIOA_IFSCER_P25 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P25		(1 << 25)
/** PIOA_IFSCER_P24 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P24		(1 << 24)
/** PIOA_IFSCER_P23 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P23		(1 << 23)
/** PIOA_IFSCER_P22 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P22		(1 << 22)
/** PIOA_IFSCER_P21 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P21		(1 << 21)
/** PIOA_IFSCER_P20 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P20		(1 << 20)
/** PIOA_IFSCER_P19 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P19		(1 << 19)
/** PIOA_IFSCER_P18 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P18		(1 << 18)
/** PIOA_IFSCER_P17 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P17		(1 << 17)
/** PIOA_IFSCER_P16 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P16		(1 << 16)
/** PIOA_IFSCER_P15 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P15		(1 << 15)
/** PIOA_IFSCER_P14 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P14		(1 << 14)
/** PIOA_IFSCER_P13 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P13		(1 << 13)
/** PIOA_IFSCER_P12 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P12		(1 << 12)
/** PIOA_IFSCER_P11 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P11		(1 << 11)
/** PIOA_IFSCER_P10 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P10		(1 << 10)
/** PIOA_IFSCER_P9 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P9		(1 << 9)
/** PIOA_IFSCER_P8 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P8		(1 << 8)
/** PIOA_IFSCER_P7 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P7		(1 << 7)
/** PIOA_IFSCER_P6 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P6		(1 << 6)
/** PIOA_IFSCER_P5 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P5		(1 << 5)
/** PIOA_IFSCER_P4 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P4		(1 << 4)
/** PIOA_IFSCER_P3 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P3		(1 << 3)
/** PIOA_IFSCER_P2 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P2		(1 << 2)
/** PIOA_IFSCER_P1 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P1		(1 << 1)
/** PIOA_IFSCER_P0 Slow Clock Debouncing Filtering Select **/
#define PIOA_IFSCER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_ifscsr IFSCSR Input Filter Slow Clock Status Register
@{*/

/** PIOA_IFSCSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P31		(1 << 31)
/** PIOA_IFSCSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P30		(1 << 30)
/** PIOA_IFSCSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P29		(1 << 29)
/** PIOA_IFSCSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P28		(1 << 28)
/** PIOA_IFSCSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P27		(1 << 27)
/** PIOA_IFSCSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P26		(1 << 26)
/** PIOA_IFSCSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P25		(1 << 25)
/** PIOA_IFSCSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P24		(1 << 24)
/** PIOA_IFSCSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P23		(1 << 23)
/** PIOA_IFSCSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P22		(1 << 22)
/** PIOA_IFSCSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P21		(1 << 21)
/** PIOA_IFSCSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P20		(1 << 20)
/** PIOA_IFSCSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P19		(1 << 19)
/** PIOA_IFSCSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P18		(1 << 18)
/** PIOA_IFSCSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P17		(1 << 17)
/** PIOA_IFSCSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P16		(1 << 16)
/** PIOA_IFSCSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P15		(1 << 15)
/** PIOA_IFSCSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P14		(1 << 14)
/** PIOA_IFSCSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P13		(1 << 13)
/** PIOA_IFSCSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P12		(1 << 12)
/** PIOA_IFSCSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P11		(1 << 11)
/** PIOA_IFSCSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P10		(1 << 10)
/** PIOA_IFSCSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P9		(1 << 9)
/** PIOA_IFSCSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P8		(1 << 8)
/** PIOA_IFSCSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P7		(1 << 7)
/** PIOA_IFSCSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P6		(1 << 6)
/** PIOA_IFSCSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P5		(1 << 5)
/** PIOA_IFSCSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P4		(1 << 4)
/** PIOA_IFSCSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P3		(1 << 3)
/** PIOA_IFSCSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P2		(1 << 2)
/** PIOA_IFSCSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P1		(1 << 1)
/** PIOA_IFSCSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOA_IFSCSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_scdr SCDR Slow Clock Divider Debouncing Register
@{*/


