grevaillot/svd_tools/headers/ATSAM4S2B/pioa.h
#define PIOA_SCDR_DIV_SHIFT		0
#define PIOA_SCDR_DIV_MASK		0x3fff
/** @defgroup pioa_scdr_div DIV Slow Clock Divider Selection for Debouncing
@{*/
/**@}*/


/**@}*/

/** @defgroup pioa_ppddr PPDDR Pad Pull-down Disable Register
@{*/

/** PIOA_PPDDR_P31 Pull-Down Disable **/
#define PIOA_PPDDR_P31		(1 << 31)
/** PIOA_PPDDR_P30 Pull-Down Disable **/
#define PIOA_PPDDR_P30		(1 << 30)
/** PIOA_PPDDR_P29 Pull-Down Disable **/
#define PIOA_PPDDR_P29		(1 << 29)
/** PIOA_PPDDR_P28 Pull-Down Disable **/
#define PIOA_PPDDR_P28		(1 << 28)
/** PIOA_PPDDR_P27 Pull-Down Disable **/
#define PIOA_PPDDR_P27		(1 << 27)
/** PIOA_PPDDR_P26 Pull-Down Disable **/
#define PIOA_PPDDR_P26		(1 << 26)
/** PIOA_PPDDR_P25 Pull-Down Disable **/
#define PIOA_PPDDR_P25		(1 << 25)
/** PIOA_PPDDR_P24 Pull-Down Disable **/
#define PIOA_PPDDR_P24		(1 << 24)
/** PIOA_PPDDR_P23 Pull-Down Disable **/
#define PIOA_PPDDR_P23		(1 << 23)
/** PIOA_PPDDR_P22 Pull-Down Disable **/
#define PIOA_PPDDR_P22		(1 << 22)
/** PIOA_PPDDR_P21 Pull-Down Disable **/
#define PIOA_PPDDR_P21		(1 << 21)
/** PIOA_PPDDR_P20 Pull-Down Disable **/
#define PIOA_PPDDR_P20		(1 << 20)
/** PIOA_PPDDR_P19 Pull-Down Disable **/
#define PIOA_PPDDR_P19		(1 << 19)
/** PIOA_PPDDR_P18 Pull-Down Disable **/
#define PIOA_PPDDR_P18		(1 << 18)
/** PIOA_PPDDR_P17 Pull-Down Disable **/
#define PIOA_PPDDR_P17		(1 << 17)
/** PIOA_PPDDR_P16 Pull-Down Disable **/
#define PIOA_PPDDR_P16		(1 << 16)
/** PIOA_PPDDR_P15 Pull-Down Disable **/
#define PIOA_PPDDR_P15		(1 << 15)
/** PIOA_PPDDR_P14 Pull-Down Disable **/
#define PIOA_PPDDR_P14		(1 << 14)
/** PIOA_PPDDR_P13 Pull-Down Disable **/
#define PIOA_PPDDR_P13		(1 << 13)
/** PIOA_PPDDR_P12 Pull-Down Disable **/
#define PIOA_PPDDR_P12		(1 << 12)
/** PIOA_PPDDR_P11 Pull-Down Disable **/
#define PIOA_PPDDR_P11		(1 << 11)
/** PIOA_PPDDR_P10 Pull-Down Disable **/
#define PIOA_PPDDR_P10		(1 << 10)
/** PIOA_PPDDR_P9 Pull-Down Disable **/
#define PIOA_PPDDR_P9		(1 << 9)
/** PIOA_PPDDR_P8 Pull-Down Disable **/
#define PIOA_PPDDR_P8		(1 << 8)
/** PIOA_PPDDR_P7 Pull-Down Disable **/
#define PIOA_PPDDR_P7		(1 << 7)
/** PIOA_PPDDR_P6 Pull-Down Disable **/
#define PIOA_PPDDR_P6		(1 << 6)
/** PIOA_PPDDR_P5 Pull-Down Disable **/
#define PIOA_PPDDR_P5		(1 << 5)
/** PIOA_PPDDR_P4 Pull-Down Disable **/
#define PIOA_PPDDR_P4		(1 << 4)
/** PIOA_PPDDR_P3 Pull-Down Disable **/
#define PIOA_PPDDR_P3		(1 << 3)
/** PIOA_PPDDR_P2 Pull-Down Disable **/
#define PIOA_PPDDR_P2		(1 << 2)
/** PIOA_PPDDR_P1 Pull-Down Disable **/
#define PIOA_PPDDR_P1		(1 << 1)
/** PIOA_PPDDR_P0 Pull-Down Disable **/
#define PIOA_PPDDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_ppder PPDER Pad Pull-down Enable Register
@{*/

/** PIOA_PPDER_P31 Pull-Down Enable **/
#define PIOA_PPDER_P31		(1 << 31)
/** PIOA_PPDER_P30 Pull-Down Enable **/
#define PIOA_PPDER_P30		(1 << 30)
/** PIOA_PPDER_P29 Pull-Down Enable **/
#define PIOA_PPDER_P29		(1 << 29)
/** PIOA_PPDER_P28 Pull-Down Enable **/
#define PIOA_PPDER_P28		(1 << 28)
/** PIOA_PPDER_P27 Pull-Down Enable **/
#define PIOA_PPDER_P27		(1 << 27)
/** PIOA_PPDER_P26 Pull-Down Enable **/
#define PIOA_PPDER_P26		(1 << 26)
/** PIOA_PPDER_P25 Pull-Down Enable **/
#define PIOA_PPDER_P25		(1 << 25)
/** PIOA_PPDER_P24 Pull-Down Enable **/
#define PIOA_PPDER_P24		(1 << 24)
/** PIOA_PPDER_P23 Pull-Down Enable **/
#define PIOA_PPDER_P23		(1 << 23)
/** PIOA_PPDER_P22 Pull-Down Enable **/
#define PIOA_PPDER_P22		(1 << 22)
/** PIOA_PPDER_P21 Pull-Down Enable **/
#define PIOA_PPDER_P21		(1 << 21)
/** PIOA_PPDER_P20 Pull-Down Enable **/
#define PIOA_PPDER_P20		(1 << 20)
/** PIOA_PPDER_P19 Pull-Down Enable **/
#define PIOA_PPDER_P19		(1 << 19)
/** PIOA_PPDER_P18 Pull-Down Enable **/
#define PIOA_PPDER_P18		(1 << 18)
/** PIOA_PPDER_P17 Pull-Down Enable **/
#define PIOA_PPDER_P17		(1 << 17)
/** PIOA_PPDER_P16 Pull-Down Enable **/
#define PIOA_PPDER_P16		(1 << 16)
/** PIOA_PPDER_P15 Pull-Down Enable **/
#define PIOA_PPDER_P15		(1 << 15)
/** PIOA_PPDER_P14 Pull-Down Enable **/
#define PIOA_PPDER_P14		(1 << 14)
/** PIOA_PPDER_P13 Pull-Down Enable **/
#define PIOA_PPDER_P13		(1 << 13)
/** PIOA_PPDER_P12 Pull-Down Enable **/
#define PIOA_PPDER_P12		(1 << 12)
/** PIOA_PPDER_P11 Pull-Down Enable **/
#define PIOA_PPDER_P11		(1 << 11)
/** PIOA_PPDER_P10 Pull-Down Enable **/
#define PIOA_PPDER_P10		(1 << 10)
/** PIOA_PPDER_P9 Pull-Down Enable **/
#define PIOA_PPDER_P9		(1 << 9)
/** PIOA_PPDER_P8 Pull-Down Enable **/
#define PIOA_PPDER_P8		(1 << 8)
/** PIOA_PPDER_P7 Pull-Down Enable **/
#define PIOA_PPDER_P7		(1 << 7)
/** PIOA_PPDER_P6 Pull-Down Enable **/
#define PIOA_PPDER_P6		(1 << 6)
/** PIOA_PPDER_P5 Pull-Down Enable **/
#define PIOA_PPDER_P5		(1 << 5)
/** PIOA_PPDER_P4 Pull-Down Enable **/
#define PIOA_PPDER_P4		(1 << 4)
/** PIOA_PPDER_P3 Pull-Down Enable **/
#define PIOA_PPDER_P3		(1 << 3)
/** PIOA_PPDER_P2 Pull-Down Enable **/
#define PIOA_PPDER_P2		(1 << 2)
/** PIOA_PPDER_P1 Pull-Down Enable **/
#define PIOA_PPDER_P1		(1 << 1)
/** PIOA_PPDER_P0 Pull-Down Enable **/
#define PIOA_PPDER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_ppdsr PPDSR Pad Pull-down Status Register
@{*/

/** PIOA_PPDSR_P31 Pull-Down Status **/
#define PIOA_PPDSR_P31		(1 << 31)
/** PIOA_PPDSR_P30 Pull-Down Status **/
#define PIOA_PPDSR_P30		(1 << 30)
/** PIOA_PPDSR_P29 Pull-Down Status **/
#define PIOA_PPDSR_P29		(1 << 29)
/** PIOA_PPDSR_P28 Pull-Down Status **/
#define PIOA_PPDSR_P28		(1 << 28)
/** PIOA_PPDSR_P27 Pull-Down Status **/
#define PIOA_PPDSR_P27		(1 << 27)
/** PIOA_PPDSR_P26 Pull-Down Status **/
#define PIOA_PPDSR_P26		(1 << 26)
/** PIOA_PPDSR_P25 Pull-Down Status **/
#define PIOA_PPDSR_P25		(1 << 25)
/** PIOA_PPDSR_P24 Pull-Down Status **/
#define PIOA_PPDSR_P24		(1 << 24)
/** PIOA_PPDSR_P23 Pull-Down Status **/
#define PIOA_PPDSR_P23		(1 << 23)
/** PIOA_PPDSR_P22 Pull-Down Status **/
#define PIOA_PPDSR_P22		(1 << 22)
/** PIOA_PPDSR_P21 Pull-Down Status **/
#define PIOA_PPDSR_P21		(1 << 21)
/** PIOA_PPDSR_P20 Pull-Down Status **/
#define PIOA_PPDSR_P20		(1 << 20)
/** PIOA_PPDSR_P19 Pull-Down Status **/
#define PIOA_PPDSR_P19		(1 << 19)
/** PIOA_PPDSR_P18 Pull-Down Status **/
#define PIOA_PPDSR_P18		(1 << 18)
/** PIOA_PPDSR_P17 Pull-Down Status **/
#define PIOA_PPDSR_P17		(1 << 17)
/** PIOA_PPDSR_P16 Pull-Down Status **/
#define PIOA_PPDSR_P16		(1 << 16)
/** PIOA_PPDSR_P15 Pull-Down Status **/
#define PIOA_PPDSR_P15		(1 << 15)
/** PIOA_PPDSR_P14 Pull-Down Status **/
#define PIOA_PPDSR_P14		(1 << 14)
/** PIOA_PPDSR_P13 Pull-Down Status **/
#define PIOA_PPDSR_P13		(1 << 13)
/** PIOA_PPDSR_P12 Pull-Down Status **/
#define PIOA_PPDSR_P12		(1 << 12)
/** PIOA_PPDSR_P11 Pull-Down Status **/
#define PIOA_PPDSR_P11		(1 << 11)
/** PIOA_PPDSR_P10 Pull-Down Status **/
#define PIOA_PPDSR_P10		(1 << 10)
/** PIOA_PPDSR_P9 Pull-Down Status **/
#define PIOA_PPDSR_P9		(1 << 9)
/** PIOA_PPDSR_P8 Pull-Down Status **/
#define PIOA_PPDSR_P8		(1 << 8)
/** PIOA_PPDSR_P7 Pull-Down Status **/
#define PIOA_PPDSR_P7		(1 << 7)
/** PIOA_PPDSR_P6 Pull-Down Status **/
#define PIOA_PPDSR_P6		(1 << 6)
/** PIOA_PPDSR_P5 Pull-Down Status **/
#define PIOA_PPDSR_P5		(1 << 5)
/** PIOA_PPDSR_P4 Pull-Down Status **/
#define PIOA_PPDSR_P4		(1 << 4)
/** PIOA_PPDSR_P3 Pull-Down Status **/
#define PIOA_PPDSR_P3		(1 << 3)
/** PIOA_PPDSR_P2 Pull-Down Status **/
#define PIOA_PPDSR_P2		(1 << 2)
/** PIOA_PPDSR_P1 Pull-Down Status **/
#define PIOA_PPDSR_P1		(1 << 1)
/** PIOA_PPDSR_P0 Pull-Down Status **/
#define PIOA_PPDSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_ower OWER Output Write Enable
@{*/

/** PIOA_OWER_P31 Output Write Enable **/
#define PIOA_OWER_P31		(1 << 31)
/** PIOA_OWER_P30 Output Write Enable **/
#define PIOA_OWER_P30		(1 << 30)
/** PIOA_OWER_P29 Output Write Enable **/
#define PIOA_OWER_P29		(1 << 29)
/** PIOA_OWER_P28 Output Write Enable **/
#define PIOA_OWER_P28		(1 << 28)
/** PIOA_OWER_P27 Output Write Enable **/
#define PIOA_OWER_P27		(1 << 27)
/** PIOA_OWER_P26 Output Write Enable **/
#define PIOA_OWER_P26		(1 << 26)
/** PIOA_OWER_P25 Output Write Enable **/
#define PIOA_OWER_P25		(1 << 25)
/** PIOA_OWER_P24 Output Write Enable **/
#define PIOA_OWER_P24		(1 << 24)
/** PIOA_OWER_P23 Output Write Enable **/
#define PIOA_OWER_P23		(1 << 23)
/** PIOA_OWER_P22 Output Write Enable **/
#define PIOA_OWER_P22		(1 << 22)
/** PIOA_OWER_P21 Output Write Enable **/
#define PIOA_OWER_P21		(1 << 21)
/** PIOA_OWER_P20 Output Write Enable **/
#define PIOA_OWER_P20		(1 << 20)
/** PIOA_OWER_P19 Output Write Enable **/
#define PIOA_OWER_P19		(1 << 19)
/** PIOA_OWER_P18 Output Write Enable **/
#define PIOA_OWER_P18		(1 << 18)
/** PIOA_OWER_P17 Output Write Enable **/
#define PIOA_OWER_P17		(1 << 17)
/** PIOA_OWER_P16 Output Write Enable **/
#define PIOA_OWER_P16		(1 << 16)
/** PIOA_OWER_P15 Output Write Enable **/
#define PIOA_OWER_P15		(1 << 15)
/** PIOA_OWER_P14 Output Write Enable **/
#define PIOA_OWER_P14		(1 << 14)
/** PIOA_OWER_P13 Output Write Enable **/
#define PIOA_OWER_P13		(1 << 13)
/** PIOA_OWER_P12 Output Write Enable **/
#define PIOA_OWER_P12		(1 << 12)
/** PIOA_OWER_P11 Output Write Enable **/
#define PIOA_OWER_P11		(1 << 11)
/** PIOA_OWER_P10 Output Write Enable **/
#define PIOA_OWER_P10		(1 << 10)
/** PIOA_OWER_P9 Output Write Enable **/
#define PIOA_OWER_P9		(1 << 9)
/** PIOA_OWER_P8 Output Write Enable **/
#define PIOA_OWER_P8		(1 << 8)
/** PIOA_OWER_P7 Output Write Enable **/
#define PIOA_OWER_P7		(1 << 7)
/** PIOA_OWER_P6 Output Write Enable **/
#define PIOA_OWER_P6		(1 << 6)
/** PIOA_OWER_P5 Output Write Enable **/
#define PIOA_OWER_P5		(1 << 5)
/** PIOA_OWER_P4 Output Write Enable **/
#define PIOA_OWER_P4		(1 << 4)
/** PIOA_OWER_P3 Output Write Enable **/
#define PIOA_OWER_P3		(1 << 3)
/** PIOA_OWER_P2 Output Write Enable **/
#define PIOA_OWER_P2		(1 << 2)
/** PIOA_OWER_P1 Output Write Enable **/
#define PIOA_OWER_P1		(1 << 1)
/** PIOA_OWER_P0 Output Write Enable **/
#define PIOA_OWER_P0		(1 << 0)

/**@}*/

