grevaillot/svd_tools/headers/ATSAM4S2B/pioa.h
/** @defgroup pioa_locksr LOCKSR Lock Status
@{*/

/** PIOA_LOCKSR_P31 Lock Status **/
#define PIOA_LOCKSR_P31		(1 << 31)
/** PIOA_LOCKSR_P30 Lock Status **/
#define PIOA_LOCKSR_P30		(1 << 30)
/** PIOA_LOCKSR_P29 Lock Status **/
#define PIOA_LOCKSR_P29		(1 << 29)
/** PIOA_LOCKSR_P28 Lock Status **/
#define PIOA_LOCKSR_P28		(1 << 28)
/** PIOA_LOCKSR_P27 Lock Status **/
#define PIOA_LOCKSR_P27		(1 << 27)
/** PIOA_LOCKSR_P26 Lock Status **/
#define PIOA_LOCKSR_P26		(1 << 26)
/** PIOA_LOCKSR_P25 Lock Status **/
#define PIOA_LOCKSR_P25		(1 << 25)
/** PIOA_LOCKSR_P24 Lock Status **/
#define PIOA_LOCKSR_P24		(1 << 24)
/** PIOA_LOCKSR_P23 Lock Status **/
#define PIOA_LOCKSR_P23		(1 << 23)
/** PIOA_LOCKSR_P22 Lock Status **/
#define PIOA_LOCKSR_P22		(1 << 22)
/** PIOA_LOCKSR_P21 Lock Status **/
#define PIOA_LOCKSR_P21		(1 << 21)
/** PIOA_LOCKSR_P20 Lock Status **/
#define PIOA_LOCKSR_P20		(1 << 20)
/** PIOA_LOCKSR_P19 Lock Status **/
#define PIOA_LOCKSR_P19		(1 << 19)
/** PIOA_LOCKSR_P18 Lock Status **/
#define PIOA_LOCKSR_P18		(1 << 18)
/** PIOA_LOCKSR_P17 Lock Status **/
#define PIOA_LOCKSR_P17		(1 << 17)
/** PIOA_LOCKSR_P16 Lock Status **/
#define PIOA_LOCKSR_P16		(1 << 16)
/** PIOA_LOCKSR_P15 Lock Status **/
#define PIOA_LOCKSR_P15		(1 << 15)
/** PIOA_LOCKSR_P14 Lock Status **/
#define PIOA_LOCKSR_P14		(1 << 14)
/** PIOA_LOCKSR_P13 Lock Status **/
#define PIOA_LOCKSR_P13		(1 << 13)
/** PIOA_LOCKSR_P12 Lock Status **/
#define PIOA_LOCKSR_P12		(1 << 12)
/** PIOA_LOCKSR_P11 Lock Status **/
#define PIOA_LOCKSR_P11		(1 << 11)
/** PIOA_LOCKSR_P10 Lock Status **/
#define PIOA_LOCKSR_P10		(1 << 10)
/** PIOA_LOCKSR_P9 Lock Status **/
#define PIOA_LOCKSR_P9		(1 << 9)
/** PIOA_LOCKSR_P8 Lock Status **/
#define PIOA_LOCKSR_P8		(1 << 8)
/** PIOA_LOCKSR_P7 Lock Status **/
#define PIOA_LOCKSR_P7		(1 << 7)
/** PIOA_LOCKSR_P6 Lock Status **/
#define PIOA_LOCKSR_P6		(1 << 6)
/** PIOA_LOCKSR_P5 Lock Status **/
#define PIOA_LOCKSR_P5		(1 << 5)
/** PIOA_LOCKSR_P4 Lock Status **/
#define PIOA_LOCKSR_P4		(1 << 4)
/** PIOA_LOCKSR_P3 Lock Status **/
#define PIOA_LOCKSR_P3		(1 << 3)
/** PIOA_LOCKSR_P2 Lock Status **/
#define PIOA_LOCKSR_P2		(1 << 2)
/** PIOA_LOCKSR_P1 Lock Status **/
#define PIOA_LOCKSR_P1		(1 << 1)
/** PIOA_LOCKSR_P0 Lock Status **/
#define PIOA_LOCKSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_wpmr WPMR Write Protection Mode Register
@{*/


#define PIOA_WPMR_WPKEY_SHIFT		8
#define PIOA_WPMR_WPKEY_MASK		0xffffff
/** @defgroup pioa_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** PIOA_WPMR_WPEN Write Protection Enable **/
#define PIOA_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup pioa_wpsr WPSR Write Protection Status Register
@{*/


#define PIOA_WPSR_WPVSRC_SHIFT		8
#define PIOA_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pioa_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** PIOA_WPSR_WPVS Write Protection Violation Status **/
#define PIOA_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup pioa_schmitt SCHMITT Schmitt Trigger Register
@{*/

/** PIOA_SCHMITT_SCHMITT31 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT31		(1 << 31)
/** PIOA_SCHMITT_SCHMITT30 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT30		(1 << 30)
/** PIOA_SCHMITT_SCHMITT29 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT29		(1 << 29)
/** PIOA_SCHMITT_SCHMITT28 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT28		(1 << 28)
/** PIOA_SCHMITT_SCHMITT27 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT27		(1 << 27)
/** PIOA_SCHMITT_SCHMITT26 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT26		(1 << 26)
/** PIOA_SCHMITT_SCHMITT25 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT25		(1 << 25)
/** PIOA_SCHMITT_SCHMITT24 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT24		(1 << 24)
/** PIOA_SCHMITT_SCHMITT23 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT23		(1 << 23)
/** PIOA_SCHMITT_SCHMITT22 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT22		(1 << 22)
/** PIOA_SCHMITT_SCHMITT21 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT21		(1 << 21)
/** PIOA_SCHMITT_SCHMITT20 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT20		(1 << 20)
/** PIOA_SCHMITT_SCHMITT19 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT19		(1 << 19)
/** PIOA_SCHMITT_SCHMITT18 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT18		(1 << 18)
/** PIOA_SCHMITT_SCHMITT17 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT17		(1 << 17)
/** PIOA_SCHMITT_SCHMITT16 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT16		(1 << 16)
/** PIOA_SCHMITT_SCHMITT15 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT15		(1 << 15)
/** PIOA_SCHMITT_SCHMITT14 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT14		(1 << 14)
/** PIOA_SCHMITT_SCHMITT13 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT13		(1 << 13)
/** PIOA_SCHMITT_SCHMITT12 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT12		(1 << 12)
/** PIOA_SCHMITT_SCHMITT11 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT11		(1 << 11)
/** PIOA_SCHMITT_SCHMITT10 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT10		(1 << 10)
/** PIOA_SCHMITT_SCHMITT9 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT9		(1 << 9)
/** PIOA_SCHMITT_SCHMITT8 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT8		(1 << 8)
/** PIOA_SCHMITT_SCHMITT7 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT7		(1 << 7)
/** PIOA_SCHMITT_SCHMITT6 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT6		(1 << 6)
/** PIOA_SCHMITT_SCHMITT5 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT5		(1 << 5)
/** PIOA_SCHMITT_SCHMITT4 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT4		(1 << 4)
/** PIOA_SCHMITT_SCHMITT3 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT3		(1 << 3)
/** PIOA_SCHMITT_SCHMITT2 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT2		(1 << 2)
/** PIOA_SCHMITT_SCHMITT1 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT1		(1 << 1)
/** PIOA_SCHMITT_SCHMITT0 Schmitt Trigger Control **/
#define PIOA_SCHMITT_SCHMITT0		(1 << 0)

/**@}*/

/** @defgroup pioa_pcmr PCMR Parallel Capture Mode Register
@{*/

/** PIOA_PCMR_FRSTS Parallel Capture Mode First Sample **/
#define PIOA_PCMR_FRSTS		(1 << 11)
/** PIOA_PCMR_HALFS Parallel Capture Mode Half Sampling **/
#define PIOA_PCMR_HALFS		(1 << 10)
/** PIOA_PCMR_ALWYS Parallel Capture Mode Always Sampling **/
#define PIOA_PCMR_ALWYS		(1 << 9)

#define PIOA_PCMR_DSIZE_SHIFT		4
#define PIOA_PCMR_DSIZE_MASK		0x03
/** @defgroup pioa_pcmr_dsize DSIZE Parallel Capture Mode Data Size
@{*/
/**@}*/

/** PIOA_PCMR_PCEN Parallel Capture Mode Enable **/
#define PIOA_PCMR_PCEN		(1 << 0)

/**@}*/

/** @defgroup pioa_pcier PCIER Parallel Capture Interrupt Enable Register
@{*/

